analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_tx_regs.h
/* *****************************************************************************
 * Copyright (C) Analog Devices, All rights Reserved.
 * 
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 * 
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 * 
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 * 
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 **************************************************************************** */

/**
 * @file    dbb_tx_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the DBB_TX Peripheral Module.
 */

#ifndef MAX32665_INCLUDE_DBB_TX_REGS_H_
#define MAX32665_INCLUDE_DBB_TX_REGS_H_

/**************************************************************************************************
  Includes
**************************************************************************************************/

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************************************
  Macros
**************************************************************************************************/

#if defined (__ICCARM__)
#pragma system_include
#endif

#if defined (__CC_ARM)
#pragma anon_unions
#endif
/*/ @cond */
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/*/ @endcond */

/* **** Definitions **** */

/**
 * @ingroup     dbb_tx
 * @defgroup    dbb_tx_registers DBB_TX_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the DBB_TX Peripheral Module.
 * @details PAN2G TX Config
 */

/**
 * @ingroup dbb_tx_registers
 * Structure type to access the DBB_TX Registers.
 */
typedef struct {
    __IO uint32_t tx_info_version;                /**< <tt>\b 0x0000:</tt> DBB_TX TX_INFO_VERSION Register */
    __IO uint16_t tx_general_standard;            /**< <tt>\b 0x0004:</tt> DBB_TX TX_GENERAL_STANDARD Register */
    __IO uint16_t tx_general_control;             /**< <tt>\b 0x0006:</tt> DBB_TX TX_GENERAL_CONTROL Register */
    __IO uint32_t tx_general_send_multi;          /**< <tt>\b 0x0008:</tt> DBB_TX TX_GENERAL_SEND_MULTI Register */
    __IO uint16_t tx_phy_high_freq_coef;          /**< <tt>\b 0x000c:</tt> DBB_TX TX_PHY_HIGH_FREQ_COEF Register */
    __IO uint16_t tx_phy_low_freq_coef;           /**< <tt>\b 0x000e:</tt> DBB_TX TX_PHY_LOW_FREQ_COEF Register */
    __IO uint32_t tx_phy_freq_carrier;            /**< <tt>\b 0x0010:</tt> DBB_TX TX_PHY_FREQ_CARRIER Register */
    __IO uint16_t tx_phy_amp_coef;                /**< <tt>\b 0x0014:</tt> DBB_TX TX_PHY_AMP_COEF Register */
    __IO uint16_t tx_phy_filt;                    /**< <tt>\b 0x0016:</tt> DBB_TX TX_PHY_FILT Register */
    __IO uint16_t tx_phy_filt_coefs[16];          /**< <tt>\b 0x0018:</tt> DBB_TX TX_PHY_FILT_COEFS Register */
    __IO uint16_t tx_phy_freq_offs;               /**< <tt>\b 0x0038:</tt> DBB_TX TX_PHY_FREQ_OFFS Register */
    __IO uint16_t tx_phy_ovrsamp_ratio;           /**< <tt>\b 0x003a:</tt> DBB_TX TX_PHY_OVRSAMP_RATIO Register */
    __IO uint16_t tx_phy_pattern_gen;             /**< <tt>\b 0x003c:</tt> DBB_TX TX_PHY_PATTERN_GEN Register */
    __IO uint16_t tx_phy_pattern;                 /**< <tt>\b 0x003e:</tt> DBB_TX TX_PHY_PATTERN Register */
    __IO uint16_t tx_phy_const_output_enable;     /**< <tt>\b 0x0040:</tt> DBB_TX TX_PHY_CONST_OUTPUT_ENABLE Register */
    __IO uint16_t tx_phy_const_output_amp;        /**< <tt>\b 0x0042:</tt> DBB_TX TX_PHY_CONST_OUTPUT_AMP Register */
    __IO uint32_t tx_phy_const_output_freq_high;  /**< <tt>\b 0x0044:</tt> DBB_TX TX_PHY_CONST_OUTPUT_FREQ_HIGH Register */
    __IO uint32_t tx_phy_const_output_freq_low;   /**< <tt>\b 0x0048:</tt> DBB_TX TX_PHY_CONST_OUTPUT_FREQ_LOW Register */
    __IO uint32_t tx_dbg_dl_lb;                   /**< <tt>\b 0x004c:</tt> DBB_TX TX_DBG_DL_LB Register */
    __IO uint16_t tx_dl_bypass;                   /**< <tt>\b 0x0050:</tt> DBB_TX TX_DL_BYPASS Register */
    __IO uint16_t tx_dl_crc_mode;                 /**< <tt>\b 0x0052:</tt> DBB_TX TX_DL_CRC_MODE Register */
    __IO uint32_t tx_dl_crc_init_phr;             /**< <tt>\b 0x0054:</tt> DBB_TX TX_DL_CRC_INIT_PHR Register */
    __IO uint32_t tx_dl_crc_init_pld;             /**< <tt>\b 0x0058:</tt> DBB_TX TX_DL_CRC_INIT_PLD Register */
    __IO uint16_t tx_dl_bch;                      /**< <tt>\b 0x005c:</tt> DBB_TX TX_DL_BCH Register */
    __IO uint16_t tx_dl_ban_settings;             /**< <tt>\b 0x005e:</tt> DBB_TX TX_DL_BAN_SETTINGS Register */
    __IO uint32_t tx_dl_btle_settings_adv_acc_addr; /**< <tt>\b 0x0060:</tt> DBB_TX TX_DL_BTLE_SETTINGS_ADV_ACC_ADDR Register */
    __IO uint32_t tx_dl_btle_settings_acc_addr;   /**< <tt>\b 0x0064:</tt> DBB_TX TX_DL_BTLE_SETTINGS_ACC_ADDR Register */
    __IO uint16_t tx_dl_btle_settings_whit;       /**< <tt>\b 0x0068:</tt> DBB_TX TX_DL_BTLE_SETTINGS_WHIT Register */
    __IO uint16_t tx_dl_btle_longrange;           /**< <tt>\b 0x006a:</tt> DBB_TX TX_DL_BTLE_LONGRANGE Register */
    __IO uint16_t tx_dl_phr_modulation;           /**< <tt>\b 0x006c:</tt> DBB_TX TX_DL_PHR_MODULATION Register */
    __IO uint16_t tx_dl_phr;                      /**< <tt>\b 0x006e:</tt> DBB_TX TX_DL_PHR Register */
    __IO uint8_t  tx_pld_mem[264];                /**< <tt>\b 0x0070:</tt> DBB_TX TX_PLD_MEM Register */
    __IO uint16_t tx_dl2_btle_speed_mode;         /**< <tt>\b 0x0178:</tt> DBB_TX TX_DL2_BTLE_SPEED_MODE Register */
} mxc_dbb_tx_regs_t;

