analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_tx_regs.h
/* Register offsets for module DBB_TX */
/**
 * @ingroup    dbb_tx_registers
 * @defgroup   DBB_TX_Register_Offsets Register Offsets
 * @brief      DBB_TX Peripheral Register Offsets from the DBB_TX Base Peripheral Address.
 * @{
 */
#define MXC_R_DBB_TX_TX_INFO_VERSION                 ((uint32_t)0x00000000UL) /**< Offset from DBB_TX Base Address: <tt> 0x0000</tt> */
#define MXC_R_DBB_TX_TX_GENERAL_STANDARD             ((uint32_t)0x00000004UL) /**< Offset from DBB_TX Base Address: <tt> 0x0004</tt> */
#define MXC_R_DBB_TX_TX_GENERAL_CONTROL              ((uint32_t)0x00000006UL) /**< Offset from DBB_TX Base Address: <tt> 0x0006</tt> */
#define MXC_R_DBB_TX_TX_GENERAL_SEND_MULTI           ((uint32_t)0x00000008UL) /**< Offset from DBB_TX Base Address: <tt> 0x0008</tt> */
#define MXC_R_DBB_TX_TX_PHY_HIGH_FREQ_COEF           ((uint32_t)0x0000000CUL) /**< Offset from DBB_TX Base Address: <tt> 0x000C</tt> */
#define MXC_R_DBB_TX_TX_PHY_LOW_FREQ_COEF            ((uint32_t)0x0000000EUL) /**< Offset from DBB_TX Base Address: <tt> 0x000E</tt> */
#define MXC_R_DBB_TX_TX_PHY_FREQ_CARRIER             ((uint32_t)0x00000010UL) /**< Offset from DBB_TX Base Address: <tt> 0x0010</tt> */
#define MXC_R_DBB_TX_TX_PHY_AMP_COEF                 ((uint32_t)0x00000014UL) /**< Offset from DBB_TX Base Address: <tt> 0x0014</tt> */
#define MXC_R_DBB_TX_TX_PHY_FILT                     ((uint32_t)0x00000016UL) /**< Offset from DBB_TX Base Address: <tt> 0x0016</tt> */
#define MXC_R_DBB_TX_TX_PHY_FILT_COEFS               ((uint32_t)0x00000018UL) /**< Offset from DBB_TX Base Address: <tt> 0x0018</tt> */
#define MXC_R_DBB_TX_TX_PHY_FREQ_OFFS                ((uint32_t)0x00000038UL) /**< Offset from DBB_TX Base Address: <tt> 0x0038</tt> */
#define MXC_R_DBB_TX_TX_PHY_OVRSAMP_RATIO            ((uint32_t)0x0000003AUL) /**< Offset from DBB_TX Base Address: <tt> 0x003A</tt> */
#define MXC_R_DBB_TX_TX_PHY_PATTERN_GEN              ((uint32_t)0x0000003CUL) /**< Offset from DBB_TX Base Address: <tt> 0x003C</tt> */
#define MXC_R_DBB_TX_TX_PHY_PATTERN                  ((uint32_t)0x0000003EUL) /**< Offset from DBB_TX Base Address: <tt> 0x003E</tt> */
#define MXC_R_DBB_TX_TX_PHY_CONST_OUTPUT_ENABLE      ((uint32_t)0x00000040UL) /**< Offset from DBB_TX Base Address: <tt> 0x0040</tt> */
#define MXC_R_DBB_TX_TX_PHY_CONST_OUTPUT_AMP         ((uint32_t)0x00000042UL) /**< Offset from DBB_TX Base Address: <tt> 0x0042</tt> */
#define MXC_R_DBB_TX_TX_PHY_CONST_OUTPUT_FREQ_HIGH   ((uint32_t)0x00000044UL) /**< Offset from DBB_TX Base Address: <tt> 0x0044</tt> */
#define MXC_R_DBB_TX_TX_PHY_CONST_OUTPUT_FREQ_LOW    ((uint32_t)0x00000048UL) /**< Offset from DBB_TX Base Address: <tt> 0x0048</tt> */
#define MXC_R_DBB_TX_TX_DBG_DL_LB                    ((uint32_t)0x0000004CUL) /**< Offset from DBB_TX Base Address: <tt> 0x004C</tt> */
#define MXC_R_DBB_TX_TX_DL_BYPASS                    ((uint32_t)0x00000050UL) /**< Offset from DBB_TX Base Address: <tt> 0x0050</tt> */
#define MXC_R_DBB_TX_TX_DL_CRC_MODE                  ((uint32_t)0x00000052UL) /**< Offset from DBB_TX Base Address: <tt> 0x0052</tt> */
#define MXC_R_DBB_TX_TX_DL_CRC_INIT_PHR              ((uint32_t)0x00000054UL) /**< Offset from DBB_TX Base Address: <tt> 0x0054</tt> */
#define MXC_R_DBB_TX_TX_DL_CRC_INIT_PLD              ((uint32_t)0x00000058UL) /**< Offset from DBB_TX Base Address: <tt> 0x0058</tt> */
#define MXC_R_DBB_TX_TX_DL_BCH                       ((uint32_t)0x0000005CUL) /**< Offset from DBB_TX Base Address: <tt> 0x005C</tt> */
#define MXC_R_DBB_TX_TX_DL_BAN_SETTINGS              ((uint32_t)0x0000005EUL) /**< Offset from DBB_TX Base Address: <tt> 0x005E</tt> */
#define MXC_R_DBB_TX_TX_DL_BTLE_SETTINGS_ADV_ACC_ADDR ((uint32_t)0x00000060UL) /**< Offset from DBB_TX Base Address: <tt> 0x0060</tt> */
#define MXC_R_DBB_TX_TX_DL_BTLE_SETTINGS_ACC_ADDR    ((uint32_t)0x00000064UL) /**< Offset from DBB_TX Base Address: <tt> 0x0064</tt> */
#define MXC_R_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT        ((uint32_t)0x00000068UL) /**< Offset from DBB_TX Base Address: <tt> 0x0068</tt> */
#define MXC_R_DBB_TX_TX_DL_BTLE_LONGRANGE            ((uint32_t)0x0000006AUL) /**< Offset from DBB_TX Base Address: <tt> 0x006A</tt> */
#define MXC_R_DBB_TX_TX_DL_PHR_MODULATION            ((uint32_t)0x0000006CUL) /**< Offset from DBB_TX Base Address: <tt> 0x006C</tt> */
#define MXC_R_DBB_TX_TX_DL_PHR                       ((uint32_t)0x0000006EUL) /**< Offset from DBB_TX Base Address: <tt> 0x006E</tt> */
#define MXC_R_DBB_TX_TX_PLD_MEM                      ((uint32_t)0x00000070UL) /**< Offset from DBB_TX Base Address: <tt> 0x0070</tt> */
#define MXC_R_DBB_TX_TX_DL2_BTLE_SPEED_MODE          ((uint32_t)0x00000178UL) /**< Offset from DBB_TX Base Address: <tt> 0x0178</tt> */
/**@} end of group dbb_tx_registers */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_INFO_VERSION DBB_TX_TX_INFO_VERSION
 * @brief    version
 * @{
 */
#define MXC_F_DBB_TX_TX_INFO_VERSION_MINOR_POS         0 /**< TX_INFO_VERSION_MINOR Position */
#define MXC_F_DBB_TX_TX_INFO_VERSION_MINOR             ((uint32_t)(0xFFUL << MXC_F_DBB_TX_TX_INFO_VERSION_MINOR_POS)) /**< TX_INFO_VERSION_MINOR Mask */

#define MXC_F_DBB_TX_TX_INFO_VERSION_MAJOR_POS         8 /**< TX_INFO_VERSION_MAJOR Position */
#define MXC_F_DBB_TX_TX_INFO_VERSION_MAJOR             ((uint32_t)(0xFFUL << MXC_F_DBB_TX_TX_INFO_VERSION_MAJOR_POS)) /**< TX_INFO_VERSION_MAJOR Mask */

/**@} end of group DBB_TX_TX_INFO_VERSION_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_GENERAL_STANDARD DBB_TX_TX_GENERAL_STANDARD
 * @brief    Standard: 1 = Zigbee (15.4), 2 = BAN (15.6),  3 = Bluetooth Low Energy (BTLE)
 * @{
 */
#define MXC_F_DBB_TX_TX_GENERAL_STANDARD_STANDARD_POS  0 /**< TX_GENERAL_STANDARD_STANDARD Position */
#define MXC_F_DBB_TX_TX_GENERAL_STANDARD_STANDARD      ((uint16_t)(0x3UL << MXC_F_DBB_TX_TX_GENERAL_STANDARD_STANDARD_POS)) /**< TX_GENERAL_STANDARD_STANDARD Mask */
#define MXC_V_DBB_TX_TX_GENERAL_STANDARD_STANDARD_ZIGBEE ((uint16_t)0x1UL) /**< TX_GENERAL_STANDARD_STANDARD_ZIGBEE Value */
#define MXC_S_DBB_TX_TX_GENERAL_STANDARD_STANDARD_ZIGBEE (MXC_V_DBB_TX_TX_GENERAL_STANDARD_STANDARD_ZIGBEE << MXC_F_DBB_TX_TX_GENERAL_STANDARD_STANDARD_POS) /**< TX_GENERAL_STANDARD_STANDARD_ZIGBEE Setting */
#define MXC_V_DBB_TX_TX_GENERAL_STANDARD_STANDARD_BAN  ((uint16_t)0x2UL) /**< TX_GENERAL_STANDARD_STANDARD_BAN Value */
#define MXC_S_DBB_TX_TX_GENERAL_STANDARD_STANDARD_BAN  (MXC_V_DBB_TX_TX_GENERAL_STANDARD_STANDARD_BAN << MXC_F_DBB_TX_TX_GENERAL_STANDARD_STANDARD_POS) /**< TX_GENERAL_STANDARD_STANDARD_BAN Setting */
#define MXC_V_DBB_TX_TX_GENERAL_STANDARD_STANDARD_BTLE ((uint16_t)0x3UL) /**< TX_GENERAL_STANDARD_STANDARD_BTLE Value */
#define MXC_S_DBB_TX_TX_GENERAL_STANDARD_STANDARD_BTLE (MXC_V_DBB_TX_TX_GENERAL_STANDARD_STANDARD_BTLE << MXC_F_DBB_TX_TX_GENERAL_STANDARD_STANDARD_POS) /**< TX_GENERAL_STANDARD_STANDARD_BTLE Setting */

/**@} end of group DBB_TX_TX_GENERAL_STANDARD_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_GENERAL_CONTROL DBB_TX_TX_GENERAL_CONTROL
 * @brief    control
 * @{
 */
#define MXC_F_DBB_TX_TX_GENERAL_CONTROL_PHY_ENABLE_POS 0 /**< TX_GENERAL_CONTROL_PHY_ENABLE Position */
#define MXC_F_DBB_TX_TX_GENERAL_CONTROL_PHY_ENABLE     ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_GENERAL_CONTROL_PHY_ENABLE_POS)) /**< TX_GENERAL_CONTROL_PHY_ENABLE Mask */

