analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_tx_regs.h
#define MXC_F_DBB_TX_TX_GENERAL_CONTROL_DL_ENABLE_POS  1 /**< TX_GENERAL_CONTROL_DL_ENABLE Position */
#define MXC_F_DBB_TX_TX_GENERAL_CONTROL_DL_ENABLE      ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_GENERAL_CONTROL_DL_ENABLE_POS)) /**< TX_GENERAL_CONTROL_DL_ENABLE Mask */

#define MXC_F_DBB_TX_TX_GENERAL_CONTROL_ENCRYPTION_ENABLE_POS 4 /**< TX_GENERAL_CONTROL_ENCRYPTION_ENABLE Position */
#define MXC_F_DBB_TX_TX_GENERAL_CONTROL_ENCRYPTION_ENABLE ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_GENERAL_CONTROL_ENCRYPTION_ENABLE_POS)) /**< TX_GENERAL_CONTROL_ENCRYPTION_ENABLE Mask */

/**@} end of group DBB_TX_TX_GENERAL_CONTROL_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_PHY_FILT DBB_TX_TX_PHY_FILT
 * @brief    filt
 * @{
 */
#define MXC_F_DBB_TX_TX_PHY_FILT_SKIP_MUX_SEL_POS      0 /**< TX_PHY_FILT_SKIP_MUX_SEL Position */
#define MXC_F_DBB_TX_TX_PHY_FILT_SKIP_MUX_SEL          ((uint16_t)(0x3FUL << MXC_F_DBB_TX_TX_PHY_FILT_SKIP_MUX_SEL_POS)) /**< TX_PHY_FILT_SKIP_MUX_SEL Mask */

#define MXC_F_DBB_TX_TX_PHY_FILT_SCALING_FACTOR_POS    6 /**< TX_PHY_FILT_SCALING_FACTOR Position */
#define MXC_F_DBB_TX_TX_PHY_FILT_SCALING_FACTOR        ((uint16_t)(0xFUL << MXC_F_DBB_TX_TX_PHY_FILT_SCALING_FACTOR_POS)) /**< TX_PHY_FILT_SCALING_FACTOR Mask */

/**@} end of group DBB_TX_TX_PHY_FILT_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_PHY_FREQ_OFFS DBB_TX_TX_PHY_FREQ_OFFS
 * @brief    freq_offs
 * @{
 */
#define MXC_F_DBB_TX_TX_PHY_FREQ_OFFS_START_POS        0 /**< TX_PHY_FREQ_OFFS_START Position */
#define MXC_F_DBB_TX_TX_PHY_FREQ_OFFS_START            ((uint16_t)(0x1FUL << MXC_F_DBB_TX_TX_PHY_FREQ_OFFS_START_POS)) /**< TX_PHY_FREQ_OFFS_START Mask */

#define MXC_F_DBB_TX_TX_PHY_FREQ_OFFS_END_POS          5 /**< TX_PHY_FREQ_OFFS_END Position */
#define MXC_F_DBB_TX_TX_PHY_FREQ_OFFS_END              ((uint16_t)(0x1FUL << MXC_F_DBB_TX_TX_PHY_FREQ_OFFS_END_POS)) /**< TX_PHY_FREQ_OFFS_END Mask */

/**@} end of group DBB_TX_TX_PHY_FREQ_OFFS_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_PHY_PATTERN_GEN DBB_TX_TX_PHY_PATTERN_GEN
 * @brief    pattern_gen
 * @{
 */
#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_EN_POS         0 /**< TX_PHY_PATTERN_GEN_EN Position */
#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_EN             ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_EN_POS)) /**< TX_PHY_PATTERN_GEN_EN Mask */

#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_RST_POS        1 /**< TX_PHY_PATTERN_GEN_RST Position */
#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_RST            ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_RST_POS)) /**< TX_PHY_PATTERN_GEN_RST Mask */

#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_MODE_POS       2 /**< TX_PHY_PATTERN_GEN_MODE Position */
#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_MODE           ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_MODE_POS)) /**< TX_PHY_PATTERN_GEN_MODE Mask */
#define MXC_V_DBB_TX_TX_PHY_PATTERN_GEN_MODE_PRBS      ((uint16_t)0x0UL) /**< TX_PHY_PATTERN_GEN_MODE_PRBS Value */
#define MXC_S_DBB_TX_TX_PHY_PATTERN_GEN_MODE_PRBS      (MXC_V_DBB_TX_TX_PHY_PATTERN_GEN_MODE_PRBS << MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_MODE_POS) /**< TX_PHY_PATTERN_GEN_MODE_PRBS Setting */
#define MXC_V_DBB_TX_TX_PHY_PATTERN_GEN_MODE_USER      ((uint16_t)0x1UL) /**< TX_PHY_PATTERN_GEN_MODE_USER Value */
#define MXC_S_DBB_TX_TX_PHY_PATTERN_GEN_MODE_USER      (MXC_V_DBB_TX_TX_PHY_PATTERN_GEN_MODE_USER << MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_MODE_POS) /**< TX_PHY_PATTERN_GEN_MODE_USER Setting */

#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_LEN_POS        3 /**< TX_PHY_PATTERN_GEN_LEN Position */
#define MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_LEN            ((uint16_t)(0x1FUL << MXC_F_DBB_TX_TX_PHY_PATTERN_GEN_LEN_POS)) /**< TX_PHY_PATTERN_GEN_LEN Mask */

/**@} end of group DBB_TX_TX_PHY_PATTERN_GEN_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL_CRC_MODE DBB_TX_TX_DL_CRC_MODE
 * @brief    crc_mode
 * @{
 */
#define MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR_POS            0 /**< TX_DL_CRC_MODE_PHR Position */
#define MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR                ((uint16_t)(0x3UL << MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR_POS)) /**< TX_DL_CRC_MODE_PHR Mask */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_BYP            ((uint16_t)0x0UL) /**< TX_DL_CRC_MODE_PHR_BYP Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PHR_BYP            (MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_BYP << MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR_POS) /**< TX_DL_CRC_MODE_PHR_BYP Setting */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_CRC4           ((uint16_t)0x1UL) /**< TX_DL_CRC_MODE_PHR_CRC4 Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PHR_CRC4           (MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_CRC4 << MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR_POS) /**< TX_DL_CRC_MODE_PHR_CRC4 Setting */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_CRC16          ((uint16_t)0x2UL) /**< TX_DL_CRC_MODE_PHR_CRC16 Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PHR_CRC16          (MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_CRC16 << MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR_POS) /**< TX_DL_CRC_MODE_PHR_CRC16 Setting */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_CRC24          ((uint16_t)0x3UL) /**< TX_DL_CRC_MODE_PHR_CRC24 Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PHR_CRC24          (MXC_V_DBB_TX_TX_DL_CRC_MODE_PHR_CRC24 << MXC_F_DBB_TX_TX_DL_CRC_MODE_PHR_POS) /**< TX_DL_CRC_MODE_PHR_CRC24 Setting */

#define MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD_POS            2 /**< TX_DL_CRC_MODE_PLD Position */
#define MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD                ((uint16_t)(0x3UL << MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD_POS)) /**< TX_DL_CRC_MODE_PLD Mask */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_BYP            ((uint16_t)0x0UL) /**< TX_DL_CRC_MODE_PLD_BYP Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PLD_BYP            (MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_BYP << MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD_POS) /**< TX_DL_CRC_MODE_PLD_BYP Setting */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_CRC4           ((uint16_t)0x1UL) /**< TX_DL_CRC_MODE_PLD_CRC4 Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PLD_CRC4           (MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_CRC4 << MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD_POS) /**< TX_DL_CRC_MODE_PLD_CRC4 Setting */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_CRC16          ((uint16_t)0x2UL) /**< TX_DL_CRC_MODE_PLD_CRC16 Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PLD_CRC16          (MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_CRC16 << MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD_POS) /**< TX_DL_CRC_MODE_PLD_CRC16 Setting */
#define MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_CRC24          ((uint16_t)0x3UL) /**< TX_DL_CRC_MODE_PLD_CRC24 Value */
#define MXC_S_DBB_TX_TX_DL_CRC_MODE_PLD_CRC24          (MXC_V_DBB_TX_TX_DL_CRC_MODE_PLD_CRC24 << MXC_F_DBB_TX_TX_DL_CRC_MODE_PLD_POS) /**< TX_DL_CRC_MODE_PLD_CRC24 Setting */

