analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_tx_regs.h
/**@} end of group DBB_TX_TX_DL_CRC_MODE_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL_BCH DBB_TX_TX_DL_BCH
 * @brief    bch
 * @{
 */
#define MXC_F_DBB_TX_TX_DL_BCH_PHR_ENABLE_POS          0 /**< TX_DL_BCH_PHR_ENABLE Position */
#define MXC_F_DBB_TX_TX_DL_BCH_PHR_ENABLE              ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BCH_PHR_ENABLE_POS)) /**< TX_DL_BCH_PHR_ENABLE Mask */

#define MXC_F_DBB_TX_TX_DL_BCH_PLD_ENABLE_POS          1 /**< TX_DL_BCH_PLD_ENABLE Position */
#define MXC_F_DBB_TX_TX_DL_BCH_PLD_ENABLE              ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BCH_PLD_ENABLE_POS)) /**< TX_DL_BCH_PLD_ENABLE Mask */

/**@} end of group DBB_TX_TX_DL_BCH_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL_BAN_SETTINGS DBB_TX_TX_DL_BAN_SETTINGS
 * @brief    ban_settings
 * @{
 */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SCRMBL_SD_POS 0 /**< TX_DL_BAN_SETTINGS_PHR_SCRMBL_SD Position */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SCRMBL_SD  ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SCRMBL_SD_POS)) /**< TX_DL_BAN_SETTINGS_PHR_SCRMBL_SD Mask */

#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS 1 /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT Position */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT  ((uint16_t)(0x7UL << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS)) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT Mask */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 ((uint16_t)0x1UL) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 ((uint16_t)0x2UL) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 ((uint16_t)0x3UL) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 ((uint16_t)0x4UL) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 ((uint16_t)0x5UL) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 Setting */

#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_MDR_LENGTH_POS 4 /**< TX_DL_BAN_SETTINGS_MDR_LENGTH Position */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_MDR_LENGTH     ((uint16_t)(0xFUL << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_MDR_LENGTH_POS)) /**< TX_DL_BAN_SETTINGS_MDR_LENGTH Mask */

#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PREAMBLE_NBR_POS 8 /**< TX_DL_BAN_SETTINGS_PREAMBLE_NBR Position */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PREAMBLE_NBR   ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PREAMBLE_NBR_POS)) /**< TX_DL_BAN_SETTINGS_PREAMBLE_NBR Mask */

#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS 9 /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD Position */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD   ((uint16_t)(0x7UL << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS)) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD Mask */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK ((uint16_t)0x0UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK ((uint16_t)0x1UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK ((uint16_t)0x2UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK ((uint16_t)0x3UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK ((uint16_t)0x4UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK ((uint16_t)0x5UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK Setting */

#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS 12 /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT Position */
#define MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT ((uint16_t)(0x7UL << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS)) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT Mask */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 ((uint16_t)0x1UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 ((uint16_t)0x2UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 ((uint16_t)0x3UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 ((uint16_t)0x4UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 Setting */
#define MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 ((uint16_t)0x5UL) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 Value */
#define MXC_S_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 (MXC_V_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 << MXC_F_DBB_TX_TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< TX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 Setting */

/**@} end of group DBB_TX_TX_DL_BAN_SETTINGS_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL_BTLE_SETTINGS_WHIT DBB_TX_TX_DL_BTLE_SETTINGS_WHIT
 * @brief    btle_settings_whit
 * @{
 */
#define MXC_F_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_CHAN_NR_POS 0 /**< TX_DL_BTLE_SETTINGS_WHIT_CHAN_NR Position */
#define MXC_F_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_CHAN_NR  ((uint16_t)(0x3FUL << MXC_F_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_CHAN_NR_POS)) /**< TX_DL_BTLE_SETTINGS_WHIT_CHAN_NR Mask */

