analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_tx_regs.h
#define MXC_F_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_BYPASS_POS 6 /**< TX_DL_BTLE_SETTINGS_WHIT_BYPASS Position */
#define MXC_F_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_BYPASS   ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_BYPASS_POS)) /**< TX_DL_BTLE_SETTINGS_WHIT_BYPASS Mask */

/**@} end of group DBB_TX_TX_DL_BTLE_SETTINGS_WHIT_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL_BTLE_LONGRANGE DBB_TX_TX_DL_BTLE_LONGRANGE
 * @brief    btle_longrange
 * @{
 */
#define MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_FECENC_EN_POS 0 /**< TX_DL_BTLE_LONGRANGE_FECENC_EN Position */
#define MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_FECENC_EN    ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_FECENC_EN_POS)) /**< TX_DL_BTLE_LONGRANGE_FECENC_EN Mask */

#define MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_FECENC_CLR_POS 1 /**< TX_DL_BTLE_LONGRANGE_FECENC_CLR Position */
#define MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_FECENC_CLR   ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_FECENC_CLR_POS)) /**< TX_DL_BTLE_LONGRANGE_FECENC_CLR Mask */

#define MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_POS   2 /**< TX_DL_BTLE_LONGRANGE_S_EQ_8 Position */
#define MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8       ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_POS)) /**< TX_DL_BTLE_LONGRANGE_S_EQ_8 Mask */
#define MXC_V_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_S8    ((uint16_t)0x1UL) /**< TX_DL_BTLE_LONGRANGE_S_EQ_8_S8 Value */
#define MXC_S_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_S8    (MXC_V_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_S8 << MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_POS) /**< TX_DL_BTLE_LONGRANGE_S_EQ_8_S8 Setting */
#define MXC_V_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_S2    ((uint16_t)0x0UL) /**< TX_DL_BTLE_LONGRANGE_S_EQ_8_S2 Value */
#define MXC_S_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_S2    (MXC_V_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_S2 << MXC_F_DBB_TX_TX_DL_BTLE_LONGRANGE_S_EQ_8_POS) /**< TX_DL_BTLE_LONGRANGE_S_EQ_8_S2 Setting */

/**@} end of group DBB_TX_TX_DL_BTLE_LONGRANGE_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL_PHR_MODULATION DBB_TX_TX_DL_PHR_MODULATION
 * @brief    Header modulation: OQPSK=0,  1 = DBPSK 2 = DQPSK, 3 = D8PSK, 4 = GMSK, 5 = GFSK
 * @{
 */
#define MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS      0 /**< TX_DL_PHR_MODULATION_MOD Position */
#define MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD          ((uint16_t)(0x7UL << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS)) /**< TX_DL_PHR_MODULATION_MOD Mask */
#define MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_OQPSK    ((uint16_t)0x0UL) /**< TX_DL_PHR_MODULATION_MOD_OQPSK Value */
#define MXC_S_DBB_TX_TX_DL_PHR_MODULATION_MOD_OQPSK    (MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_OQPSK << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS) /**< TX_DL_PHR_MODULATION_MOD_OQPSK Setting */
#define MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_DBPSK    ((uint16_t)0x1UL) /**< TX_DL_PHR_MODULATION_MOD_DBPSK Value */
#define MXC_S_DBB_TX_TX_DL_PHR_MODULATION_MOD_DBPSK    (MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_DBPSK << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS) /**< TX_DL_PHR_MODULATION_MOD_DBPSK Setting */
#define MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_DQPSK    ((uint16_t)0x2UL) /**< TX_DL_PHR_MODULATION_MOD_DQPSK Value */
#define MXC_S_DBB_TX_TX_DL_PHR_MODULATION_MOD_DQPSK    (MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_DQPSK << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS) /**< TX_DL_PHR_MODULATION_MOD_DQPSK Setting */
#define MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_D8PSK    ((uint16_t)0x3UL) /**< TX_DL_PHR_MODULATION_MOD_D8PSK Value */
#define MXC_S_DBB_TX_TX_DL_PHR_MODULATION_MOD_D8PSK    (MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_D8PSK << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS) /**< TX_DL_PHR_MODULATION_MOD_D8PSK Setting */
#define MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_GMSK     ((uint16_t)0x4UL) /**< TX_DL_PHR_MODULATION_MOD_GMSK Value */
#define MXC_S_DBB_TX_TX_DL_PHR_MODULATION_MOD_GMSK     (MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_GMSK << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS) /**< TX_DL_PHR_MODULATION_MOD_GMSK Setting */
#define MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_GFSK     ((uint16_t)0x5UL) /**< TX_DL_PHR_MODULATION_MOD_GFSK Value */
#define MXC_S_DBB_TX_TX_DL_PHR_MODULATION_MOD_GFSK     (MXC_V_DBB_TX_TX_DL_PHR_MODULATION_MOD_GFSK << MXC_F_DBB_TX_TX_DL_PHR_MODULATION_MOD_POS) /**< TX_DL_PHR_MODULATION_MOD_GFSK Setting */

/**@} end of group DBB_TX_TX_DL_PHR_MODULATION_Register */

/**
 * @ingroup  dbb_tx_registers
 * @defgroup DBB_TX_TX_DL2_BTLE_SPEED_MODE DBB_TX_TX_DL2_BTLE_SPEED_MODE
 * @brief    Set BTLE speed mode 0 = 1 Mb/s, 1 = 2 Mb/s
 * @{
 */
#define MXC_F_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_POS  0 /**< TX_DL2_BTLE_SPEED_MODE_SPEED Position */
#define MXC_F_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED      ((uint16_t)(0x1UL << MXC_F_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_POS)) /**< TX_DL2_BTLE_SPEED_MODE_SPEED Mask */
#define MXC_V_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_1M   ((uint16_t)0x0UL) /**< TX_DL2_BTLE_SPEED_MODE_SPEED_1M Value */
#define MXC_S_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_1M   (MXC_V_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_1M << MXC_F_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_POS) /**< TX_DL2_BTLE_SPEED_MODE_SPEED_1M Setting */
#define MXC_V_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_2M   ((uint16_t)0x1UL) /**< TX_DL2_BTLE_SPEED_MODE_SPEED_2M Value */
#define MXC_S_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_2M   (MXC_V_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_2M << MXC_F_DBB_TX_TX_DL2_BTLE_SPEED_MODE_SPEED_POS) /**< TX_DL2_BTLE_SPEED_MODE_SPEED_2M Setting */

/**@} end of group DBB_TX_TX_DL2_BTLE_SPEED_MODE_Register */

#ifdef __cplusplus
}
#endif

#endif // MAX32665_INCLUDE_DBB_TX_REGS_H_
